#  SQL Queries with Equivalent Python code using Pandas

In [1]:
import mysql.connector as sql

In [6]:
mydb = sql.connect(
  host="localhost",
  user="root",
  password="12345"
)

In [7]:
 mycursor = mydb.cursor()

mycursor.execute("SHOW DATABASES")

for x in mycursor:
    print(x)

('hello',)
('information_schema',)
('mall_customer',)
('mukesh',)
('mydatabase',)
('mysql',)
('newb',)
('performance_schema',)
('sakila',)
('shop_customers',)
('student',)
('sys',)
('testdb',)
('world',)

In [8]:
mydb = sql.connect(
  host="localhost",
  user="root",
  password="12345",
  database="shop_customers"
)

In [9]:
mycursor = mydb.cursor()

mycursor.execute("SHOW TABLES")

for x in mycursor:
    print(x)

('shop_customers',)

In [10]:
def query(sql):
    mycursor = mydb.cursor()
    
    mycursor.execute(sql)
    
    myresult = mycursor.fetchall()
    
    for x in myresult:
        print(x)

In [11]:
import pandas as pd

customers = pd.read_csv('D:\Final submission\Sql\Shop_Customers.csv')

##### SELECT Statement

In [12]:
query("SELECT * FROM shop_customers")

(201, 'Male', 61, 31, 39)
(202, 'Male', 63, 31, 81)
(203, 'Female', 59, 23, 6)
(204, 'Female', 37, 23, 77)
(205, 'Female', 45, 19, 40)
(206, 'Female', 47, 19, 76)
(207, 'Female', 55, 32, 6)
(208, 'Female', 23, 24, 94)
(209, 'Male', 28, 25, 3)
(210, 'Female', 29, 17, 72)
(211, 'Male', 41, 18, 14)
(212, 'Female', 20, 19, 99)
(213, 'Female', 59, 21, 15)
(214, 'Female', 53, 22, 77)
(215, 'Male', 48, 22, 13)
(216, 'Male', 64, 26, 79)
(217, 'Female', 67, 26, 35)
(218, 'Male', 67, 27, 66)
(219, 'Male', 20, 28, 29)
(220, 'Female', 23, 24, 98)

In [13]:
'''SELECT * FROM customers'''           #SQL Statement (Simple SELECT)

customers                               #Pandas Equivalant

    CustomerID   Genre  Age  Annual_Income_K_Dollars  Spending_Score_1_to_100
0          201    Male   61                       31                       39
1          202    Male   63                       31                       81
2          203  Female   59                       23                        6
3          204  Female   37                       23                       77
4          205  Female   45                       19                       40
5          206  Female   47                       19                       76
6          207  Female   55                       32                        6
7          208  Female   23                       24                       94
8          209    Male   28                       25                        3
9          210  Female   29                       17                       72
10         211    Male   41                       18                       14
11         212  Female   20                       19                       99
12         213  Female   59                       21                       15
13         214  Female   53                       22                       77
14         215    Male   48                       22                       13
15         216    Male   64                       26                       79
16         217  Female   67                       26                       35
17         218    Male   67                       27                       66
18         219    Male   20                       28                       29
19         220  Female   23                       24                       98

##### Using LIMIT

In [14]:
query("SELECT * FROM shop_customers LIMIT 5")

(201, 'Male', 61, 31, 39)
(202, 'Male', 63, 31, 81)
(203, 'Female', 59, 23, 6)
(204, 'Female', 37, 23, 77)
(205, 'Female', 45, 19, 40)

In [15]:
# Using SQL, SELECT Statement with limited number of records
'''SELECT * FROM Mall_customers LIMIT 5'''

# Using Pandas
customers.head(5)

   CustomerID   Genre  Age  Annual_Income_K_Dollars  Spending_Score_1_to_100
0         201    Male   61                       31                       39
1         202    Male   63                       31                       81
2         203  Female   59                       23                        6
3         204  Female   37                       23                       77
4         205  Female   45                       19                       40

##### SELECT...WHERE Clause

In [16]:
query("SELECT CustomerID FROM shop_customers WHERE Annual_Income_K_Dollars = 16")

In [13]:
# SQL Statement (SELECT and WHERE on single condition)
'''SELECT CustomerID FROM customers 
WHERE Annual_Income_K_Dollars = 16'''

# Using Pandas
customers[customers.Annual_Income_K_Dollars == 16].CustomerID

2    3
3    4
Name: CustomerID, dtype: int64

##### SELECT...WHERE Clause with Multiple conditions, All columns

In [21]:
query("SELECT * FROM shop_customers WHERE Annual_Income_K_Dollars = 15 AND Spending_Score_1_to_100 = 81")

None

In [20]:
#  SQL Statement (SELECT and WHERE on multiple conditions, all the columns Selected)
'''SELECT * FROM customers 
WHERE Annual_Income_K_Dollars = 15 
AND Spending_Score_1_to_100 = 81'''

# Using Pandas
customers[(customers.Annual_Income_K_Dollars == 15) & (customers.Spending_Score_1_to_100 == 81)]

Empty DataFrame
Columns: [CustomerID, Genre, Age, Annual_Income_K_Dollars, Spending_Score_1_to_100]
Index: []

##### SELECT...WHERE Clause with Multiple conditions, Specific columns

In [26]:
query("SELECT Genre, Age, Spending_Score_1_to_100 FROM shop_customers WHERE Annual_Income_K_Dollars = 15 AND  Spending_Score_1_to_100 = 81")

In [27]:
#SQL Statement (SELECT and WHERE on multiple conditions Specific Columns Selected)
'''SELECT Gender, Age, Spending_Score_1_to_100 
FROM customers 
WHERE Annual_Income_K_Dollars = 15 
AND  Spending_Score_1_to_100 = 81'''

# Using Pandas
customers[(customers.Annual_Income_K_Dollars == 15) & (customers.Spending_Score_1_to_100 == 81)][['Genre', 'Age', 'Spending_Score_1_to_100']]

Empty DataFrame
Columns: [Genre, Age, Spending_Score_1_to_100]
Index: []

##### AGGREGATE Functions

In [28]:
query("SELECT AVG(Age), MAX(Age), MIN(Age) FROM shop_customers")

(Decimal('45.4500'), 67, 20)

In [29]:
#SQL Statement (Operation using AGGREGATE functions like MEAN, MIN and MAX)
'''SELECT avg(Age), max(Age), min(Age) 
FROM customers'''

#Using Pandas
customers.agg({'Age': ['mean', 'max', 'min']})

        Age
mean  45.45
max   67.00
min   20.00

##### DISTINCT Clause

In [30]:
query("SELECT DISTINCT Annual_Income_K_Dollars FROM shop_customers")

(31,)
(23,)
(19,)
(32,)
(24,)
(25,)
(17,)
(18,)
(21,)
(22,)
(26,)
(27,)
(28,)

In [31]:
# SQL Statement (getting distinct values of a column)
'''SELECT DISTINCT Annual_Income_K_Dollars 
FROM customers'''

# Using Pandas
customers.Annual_Income_K_Dollars.unique()

array([31, 23, 19, 32, 24, 25, 17, 18, 21, 22, 26, 27, 28], dtype=int64)

# Thank you